"use client";

import Image from "next/image";
import Link from "next/link";
import React from "react";
import banner from "@images/bannerTwo.jpg";
import useExStudentStore from "../global/ExistingStudentData";

const GuidePage = () => {
  const { studentType } = useExStudentStore();
  return (
    <>
      <div className="banner">
        <Image
          src={banner}
          alt="background"
          className="banner-image"
          style={{ width: "100%", height: "auto" }}
          // objectFit="cover"
        />
        <div className="textTitle">
          <h4 className="heading">A/L Application Form</h4>
          <h4 className="subHeading">Mayurapada Central College Narammala</h4>
        </div>
      </div>
      <div className="guidePage">
        <div className="container">
          <h1>
            අ.පො.ස (උ/පෙළ) විභාගය සඳහා අයදුම්පත් නිකුත් කිරීමේ උපදෙස් පත්‍රිකාව
          </h1>
          <p>(ව/ගි​රි මයුරපාද ම​ධ්‍ය විද්‍යාලය (ජාතික පාසල), නාරම්මල)</p>

          <ol>
            <li>
              2023 චර්ෂෙය්‌ අ.පො.ස.(සා.පෙළ) විභාගය සදහා පෙනී සිටි
              ශිෂ්‍ය/ශිෂ්‍යාවන්‌ අප විද්‍යාලයේ වෙබ්‌ අඩවිය (al.mayurapada.lk)
              චෙත පිචිස මාර්‌ගගත ක්‍රමය ඔස්සේ (online) පමණක්‌ අයදුම්‌ පත්‍ර යොමු
              කළ යුතුයි. නියමිත පරිදි සම්පූර්ණ කර නිචැරදිච මාර්ග ගත ක්‍රමය ඔස්සේ
              යොමු කිරීමෙන්‌ පසුව යොමු අංකයක් සහිත අයදුම්පත්‍රය Email හරහා
              ලැබෙනු ඇ​ත‌.එ​ම යොමු අංකය සහිත අයදුම්පන මුද්‍රණය කර{" "}
              <b>`විදුහල්පති, මයුරපාද ම​ධ්‍ය විද්‍යාලය, නාරම්මල`</b> යන ලිපිනයට
              තැපැල් මගින් යොමුකරන්​න. ඒ පිළිබඳව විමසීම කිරීමේදී මෙම යොමු අංකය
              අත්‍යාවශ්‍ය වේ. තැපැල්‌ මගින්‌ පමණක් එවන අයදුම්පත්‍ර භාරගනු
              නොලැබේ.
            </li>

            <li>
              අ.පො.ස (උ/පෙළ) 2024/ 2026 අධ්‍යයන චර්ෂයේ සියලුම චිෂය ධාරාවන්‌
              (විද්‍යා, ගණිතන, චාණිජ, කලා හා තාක්ෂණවේදය) සිංහල මාධ්‍යයෙන්‌ පංති
              පැවැත්වේ. භෞතීය විද්‍යා චිෂය ධාරාව හා තොරතුරු හා සන්නිවේදන තාක්ෂණය
              චිෂය පමණක්‌ සිංහල හා ඉංග්‍රීසි මාධ්‍ය දෙකෙන්ම පැවැත්වේ.
            </li>

            <li>
              සියලුම අයදුම්කරුවන්‌ අ.පො.ස.(සං/පෙළ) 2023 විභාගයේදී මාධ්‍ය භාෂාව
              හා ගණිනය චිෂයයන්‌ ඇතුළුව චිෂයයන්‌ හයකින්‌ සමත්ව සම්මාන සාමාර්ථ
              තුනක්‌ ලබා තිබීම අනිචාර්ය වේ.
            </li>

            <li>අ.පො.ස. (උ/පෙළ) විෂයධාරාවන්‌ සදහා විෂය සංයෝජන පහත පරිදි වේ.</li>
          </ol>

          <h2>විද්‍යා විෂය ධාරාව</h2>

          <table>
            <tr>
              <th>
                භෞතී​ය විෂය අංශය
                <br />
                (සිංහ​ල හා ඉංග්‍රීසි මාධ්‍ය)
              </th>
              <th>
                ජීව විද්‍යා අංශය
                <br />
                (සිංහල මාධ්‍ය)
              </th>
              <th>
                කෘෂි විද්‍යා අංශය
                <br />
                (සිංහල මාධ්‍ය)
              </th>
            </tr>
            <tr>
              <td>සංයුක්ත ගණිතය</td>
              <td>ජීව විද්‍යාව</td>
              <td>ජීව විද්‍යාව</td>
            </tr>
            <tr>
              <td>
                රසායන විද්‍යාව/
                <br />
                තොරතුරු හා සන්නිවේදන තාක්ෂණය
              </td>
              <td>රසායන විද්‍යාව</td>
              <td>රසායන විද්‍යාව</td>
            </tr>
            <tr>
              <td>භෞතික විද්‍යාව</td>
              <td>භෞතික විද්‍යාව</td>
              <td>කෘෂි විද්‍යාව</td>
            </tr>
          </table>

          <p>
            විද්‍යා චිෂය ධාරාචට ඇතුළත්‌ වීමට බලාපොරොත්තු චන ශිෂ්‍ය ශිෂ්‍යාවන්‌
            සදහා විද්‍යාව හා ගණිනය යන විෂයයන්‌ දෙකටම A හෝ 8 සාමාර්ථ ලබා නිබීම
            අනිචාර්ය චන අතර ඉංග්‍රීසි විෂය සදහා C සාමාර්ථය ලබා නිබිය යුතු අතර S
            සාමාර්ථයක්‌ ලබා ඇති ශිෂ්‍ය ශිෂ්‍යාවන්‌ සම්බන්ධයෙන්‌ චිද්‍යා චිෂය
            ධාරාව හැදෑරීම සදහා තචදුරටන්‌ පවතින ඉතිරි පුරප්පාඩු සලකා බලා බදවා
            ගැනීමට කටයුතු කරනු ලැබේ. ඉංග්‍රීසි මාධ්‍යයෙන්‌ භෞතීය විද්‍යාව චිෂය
            ධාරාව හැදෑරීම සඳහා ඉංග්‍රීසි විෂයට A සාමාර්ථයක්‌ තිබියි යුතුය. කෘෂි
            විද්‍යාව හැදෑරීමට බලාපොරොත්තු චන ශිෂ්‍ය ශිෂ්‍යාවන්‌ සදහා
            අ.පො.ස.(සා.පෙළ) විභාගයේදී කෘෂි චිද්‍යාවට A හෝ B සාමාර්ථ ලබා ඇත්නම්‌
            විද්‍යාව හෝ ගණිනය B සාමාර්ථය ලබා තිබීම ප්‍රමාණවත්‌ වේ.
          </p>

          <h2>වාණිජ විෂය ධාරාව</h2>
          <p>වාණිජ අංශය (සිංහල මාධ්‍ය) :</p>
          <ol>
            <li>ගිණුම්කරණය</li>
            <li>ව්‍යාපාර අධ්‍යයනය/ තොරතුරු හා සන්නිවේදන තාක්ෂණය</li>
            <li>ආර්ථික විද්‍යාව</li>
          </ol>

          <p>
            චාණිජ චිෂය ධාරාවට ඇතුළත්‌ වීමට බලාපොරොත්තු චන්නේ නම්‌ ගණිතය චිෂයට A
            හෝ 8 සාමාර්ථ ලබා තිබිය යුතුයි. (සැ.යු. ච්‍යාපාර භා ගිණුම්කරණ
            අධ්‍යයනය චිෂයයට A සාමාර්ථ ලබා ඇත්නම්‌ ගණිතය චිෂයයට C සාමාර්ථයක්‌
            ප්‍රමාණවත්‌ වේ.)
          </p>

          <h2>තාක්ෂණවේදය විෂය ධාරාව</h2>
          <p>තාක්ෂණ අංශය (සිංහල මාධ්‍ය) :</p>
          <ol>
            <li>ඉංජිනේරු තාක්ෂණවේදය/ ජෛව පද්ධති තාක්ෂණවේදය</li>
            <li>තාක්ෂණවේදය සඳහා විද්‍යාව</li>
            <li>
              භූගෝල චිද්‍යාච/ තොරතුරු හා සන්නිවේදන තාක්ෂණය/ කෘෂි විද්‍යාච/
              ආර්ථික චිද්‍යාව/ ගණිතය සන්නිවේදනය භා මාධ්‍ය අධ්‍යයනය/ චිත්‍ර.
            </li>
          </ol>

          <p>
            තාක්ෂණවේදය චිෂය ධාරාව යටතේ ඉංජිනේරු තාක්ෂණවේදය හැදැරීමට, ගණිතය විෂයට
            A හෝ B සාමාර්ථ ලබා තිබිය යුතු අතර, විද්‍යාව සදහා සම්මාන සාමාර්ථයක්‌
            ලබා තිබිය යුතුයි. ජෛව පද්ධනි තාක්ෂණවේදය හැදැරීම සදහා විද්‍යාව විෂයය
            සදහා A හෝ B සාමාර්ථ ලබා තිබිය යුතු අතර, ගණිතය විෂය සදහා සම්මාන
            සාමාර්ථයක්‌ ලබා නිබිය යුතුයි.
          </p>

          <p>
            තුන්චන චිෂයයන්‌ (ඛාණ්ඩ විෂය) තෝරා ගැනිමේදී, තොරතුරු හා සන්නිවේදන
            තාක්ෂණය චිෂය සඳූහා අ.පො.ස. (සා/පෙළ) තොරතුරු තාක්ෂණ චිෂය සදහා A
            සාමාර්ථයක්‌ තිබීම විශේෂ සුදුසුකමක්‌ ලෙස සලකනු ලැබේ. කෘෂි චිද්‍යාව
            තෝරා ගැනීමේදී අ.පො.ස. (සා/පෙළ) විද්‍යාව විෂයය සදහා B සාමාර්ථයකට වඩා
            ඉහළ සාමාර්ථයක්‌ තිබිය යුතු වන අතර අ.පො.ස. (සා/පෙළ) කෘෂි විද්‍යාව
            විෂය හදාරා ඉහළ සාමාර්ථ ඇති සිසුන්‌ කෙරෙහි චැඩි සැලකිල්ලක්‌ දක්චයි.
          </p>

          <p>
            භූගෝල චිද්‍යාච, සන්නිවේදනය හා මාධ්‍ය අධ්‍යයනය, ගෘහ ආර්ථික චිද්‍යාව,
            චිත්‍ර .... ආදී අනෙකුත්‌ විෂයන්‌ සඳහා තාක්ෂණ අංශයට ඇතුළත්‌ චීම සදහා
            ප්‍රමාණවත්‌ මූලික සුදුසුකම්‌ සම්පූර්ණ කිරීම ප්‍රමාණවත්‌ චේ.
          </p>

          <p>
            එසේම යම්‌ ඛාණ්ඩ චිෂයයක්‌ සදහා ප්‍රමාණවත්‌ සිසුන්‌ සංඛ්‍යාවක්‌ (අවම
            10) ඉල්ලුම්‌ නොකර ඇති චිට එම ඛාණ්ඩ විෂය ඉචත්‌ කිරීමට සිදුවිය හැක.
            එසේම යම්‌ ඛාණ්ඩ විෂයයක්‌ සදහා ප්‍රමාණවත්‌ සිසුන්‌ සංඛ්‍යාවකට වඩා
            වැඩි සිසුන්‌ සංඛ්‍යාවක්‌ ඉල්ලුම්‌ කර ඇති චිට අ.පො.ස. (සා/පෙළ) විෂය
            සදහා ලබාගන්‌ ප්‍රචීනතා මත පිරිණමනු ලබන ලකුණු ක්‍රමයක් මත ඛාණ්ඩ චිෂය
            තෝරා ගැනීම සිදුකරයි.
          </p>

          <h2>කලා විෂය ධාරාව</h2>
          <table>
            <tr>
              <th>
                12K
                <br />
                (සිංහ​ල මාධ්‍ය සමා​ජ විද්‍යා විෂයයන්)
              </th>
              <th>
                12L
                <br />
                (සිංහ​ල මාධ්‍ය භාෂා හා අනෙකු​ත් විෂයයන්)
              </th>
              <th>
                12M
                <br />
                (සිංහ​ල මාධ්‍ය සෞන්දර්​ය විෂයයන්)
              </th>
            </tr>
            <tr>
              <td>
                <ol>
                  <li>
                    සන්නිවේදනය හා මාධ්‍ය අධ්‍යයනය/ ආර්ථික විද්‍යා​ව/ භූගෝල
                    චිද්‍යාව/
                  </li>
                  <li>ඉතිහාස​ය/ දේශපාලන විද්‍යාව/ කෘෂි විද්‍යාව</li>
                  <li>
                    සිංහල/ තර්ක ශාස්ත්‍රය/ ගෘහ ආර්ථික විද්‍යාව/ බෞද්ධ
                    ශිෂ්ඨාචාරය/ නොරතුරු හා සන්නිවේදන නාක්ෂණය/ ආර්ථික විද්‍යාව.
                  </li>
                </ol>
              </td>
              <td>
                <ol>
                  <li>චීන/ කොරියන්/ ප්‍රංශ/ ජර්මන්/ හින්දි/ ජපන්</li>
                  <li>
                    දේශපාලන විද්‍යාව/ සන්නිවේදනය හා මාධ්‍ය අධ්‍යයනය/ ඉංග්‍රීසි
                    භාෂා​ව/ බෞද්ධ ශිෂ්ඨාචාරය/ කෘෂි විද්‍යාව/ භූගෝල විද්‍යාව
                  </li>
                  <li>
                    සිංහල/ තොරතුරු හා සන්නිවේදන තාක්ෂණය/ තර්ක ශාස්ත්‍රය/ ගෘහ
                    ආර්ථික විද්‍යාව.
                  </li>
                </ol>
              </td>
              <td>
                <ol>
                  <li>
                    සන්නිවේදනය හා මාධ්‍ය අධ්‍යයනය/ භූගෝ​ල විද්‍යාව/ දේශපාලන
                    විද්‍යාව/ තොරතුරු හා සන්නිවේදන තාක්ෂණය/ නාට්‍ය හා රංගකලාව
                  </li>
                  <li>ඉතිහාසය/ සිංහල/ ගෘහ ආර්ථික විද්‍යාව.</li>
                  <li>චිත්‍ර/ නාට්‍ය/ සංගීත</li>
                </ol>
              </td>
            </tr>
          </table>

          <p>
            ඔබ කලා චිෂය ධාරාව තෝරා ගන්නේ නම්‌ පහත සදහන්‌ ආකාරයට සමාජ විද්‍යා
            විෂයයන්‌, භාෂා හා අනෙකුත්‌ විෂයයන්‌ භා සෞන්දර්යය විෂයයන්‌ ලෙස පංති
            තුනක්‌ පමණක්‌ පචනින බැචින්‌ එම පංති වල විෂය සංයෝජනයන්ට අනුව එක්‌
            කාණ්ඩයකින් එක්‌ විෂයක්‌ පමණක්‌ බැගින්‌ වන සේ අදාළ විෂයයන්‌ තෝරා ගත
            යුතුයි.
          </p>
          <p>
            <strong>සැ.යු.</strong> අ.පො.ස. (උ/පෙළ) සදහා තොරතුරු තාක්ෂණය
            ඉල්ලුම්කරන ශිෂ්‍ය ශිෂ්‍යාවන්ට ගණිනය චිෂයයට A සාමාර්ථයද විද්‍යා
            විෂයයට B සාමාර්ථය ද තොරතුරු තාක්ෂණ විෂය සදහා A හෝ B සාමාර්ථ ලබා
            තිබිය යුතුයි. අ.පො.ස. (උ/පෙළ) සියලු විෂය ධාරාවන්‌ සදහා සිසුන්‌
            ඇතුළත්‌ කිරීමේදී ඒ සඳහා මූලික සුදුසුකම්‌ සපුරා ඇති අයදුම්කරුවන්‌
            අතුරින්‌ ඉහළ සුදුසුකම්‌ සහිත අයදුම්කරුවන්‌ සදහා ප්‍රමුඛත්වය හිමිවනු
            ඇත.
          </p>
          <div className="navigateBtns" style={{ marginTop: "20px" }}>
            <Link href="/" className="backBtn">
              Back To Home
            </Link>
            <Link
              href={
                studentType === "Existing Student"
                  ? "/existing-student-form/personal-info/"
                  : "/new-student-form/personal-info/"
              }
              className="nextBtn"
            >
              Next
            </Link>
          </div>
        </div>
      </div>
    </>
  );
};

export default GuidePage;
